app/views/tweeets/_profile.html.erb

SELECT COUNT(*) FROM "tweeets" WHERE "tweeets"."user_id" = ?  [["user_id", 2]]
---
                            <p class="heading">Tweets</p>
                            <p class="title is-6"><%= current_user.tweeets.count %></p>