app/controllers/tweeets_controller.rb

  def index
    @tweeets = Tweeet.all
    @users = User.all
---
SELECT "tweeets".* FROM "tweeets"
SELECT "users".* FROM "users"

  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save
---
INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweeet", "Hello"], ["created_at", "2020-04-30 16:03:58.017740"], ["updated_at", "2020-04-30 16:03:58.017740"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @tweeet.update(tweeet_params)
---
UPDATE "tweeets" SET "tweeet" = ?, "updated_at" = ? WHERE "tweeets"."id" = ?  [["tweeet", "aa"], ["updated_at", "2020-04-29 19:30:47.174796"], ["id", 15]]

  def destroy
    @tweeet.destroy if user_signed_in?
---
DELETE FROM "tweeets" WHERE "tweeets"."id" = ?  [["id", 26]]